app/controllers/companies_controller.rb

  def packsupdate
    @company = Company.find(params[:id])

    if @company.packs == 0
      render :text => "nopacks"
      return

    else if @company.packs != 0
      @company.decrement!(:packs)
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1)
UPDATE "companies" SET "updated_at" = '2010-05-07 21:42:04', "pip" = 'In The Works', "notes" = 'something', "packs" = 3, "urls" = '' WHERE "id" = 5

  def show
    @company = current_user.companies.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2053932787 AND ("companies".user_id = 3))

  def edit
    @company = current_user.companies.find(params[:id])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2053932788 AND ("companies".user_id = 3))

  def create
    @company = current_user.companies.build(params[:company])

    respond_to do |format|
      if @company.save
---
INSERT INTO "companies" ("name", "created_at", "urls", "pip_id", "notes", "main_contact_email", "updated_at", "user_id", "main_contact", "usernames") VALUES('company', '2010-03-19 15:07:16', 'these are some urls for the company', 1, 'These are some notes for the company', 'jmarantz@google.com', '2010-03-19 15:07:16', 1, 'josh marantz', 'no usernames')

  def update
    @company = current_user.companies.find(params[:id])

    respond_to do |format|
      if @company.update_attributes(params[:company])
---
SELECT * FROM "companies" WHERE ("companies"."id" = 1 AND ("companies".user_id = 3))
UPDATE "companies" SET "updated_at" = '2010-03-22 21:25:48', "notes" = 'Vlingo is testing a mobile app and they require a lot of work. That actually wasnt very funny', "pip_id" = 3 WHERE "id" = 2

  def destroy
    @company = current_user.companies.find(params[:id])
    @company.destroy
---
SELECT * FROM "companies" WHERE ("companies"."id" = 2053932789 AND ("companies".user_id = 3))
DELETE FROM "companies" WHERE "id" = 2053932789