app/controllers/users_controller.rb

  def getcompanies
    @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 3)

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "role", "remember_token", "login", "email") VALUES('82fa0331ac57b1de9dd6504d8edcb6afcd06d148', '2010-05-08 01:55:30', '03b96fe2fa868bb2f7aeccf26deea03b2f4795a2', NULL, '2010-05-08 01:55:30', NULL, NULL, 'test', 'test')